Fuel_Pin/constant/cladding/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   91.224;
    }

    transport
    {
        kappaCoeffs<8>   (7.51 2.09e-2 -1.45e-5 7.67e-9 0 0 0 0);
    }

    thermodynamics
    {
        Hf      0;
		Sf		0;
        CpCoeffs<8>      (1355 -5.635 0.008995 -4.11e-6 0 0 0 0);
    }

    equationOfState
    {
        rho     6511;
    }
}

// ************************************************************************* //
