Fuel_Pin/constant/fuel/createMatDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      createMatDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

material fuel;
zoneNames (fuel158 fuel340);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
