Fuel_Pin/constant/fuel/mappingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mappingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tol	1e-9;

pitch 1.25984e-2;

pointList
(
	(0.0 0.0 0.0)
);

radiusList
(
	0.0
	0.002
	0.0041
);

axialList
(
	0.0
	0.170688
	0.341376
	0.5120640000000001
	0.682752
	0.85344
	1.0241280000000001
	1.194816
	1.365504
	1.536192
	1.70688
	1.8775680000000001
	2.0482560000000003
	2.218944
	2.389632
	2.56032
	2.731008
	2.9016960000000003
	3.072384
	3.243072
	3.41376
	3.584448
	3.7551360000000003
	3.925824
	4.096512000000001
	4.2672
);

angleList
(
    45
    135
    225
    315
    45
);




// ************************************************************************* //
