Fuel_Pin/constant/fuel/volPower
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "/home/tomas/OpenFOAM/tomas-v2106/run/AP-1000/pin_R2A4Ax25/constant/fuel";
    object      volPower;
}

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar>
16000
(
 3.26662E+07
 3.26662E+07
 3.26662E+07
 3.26662E+07
 3.24066E+07
 3.26662E+07
 3.26662E+07
 3.26662E+07
...
)
;

boundaryField
{
    zmax
    {
        type            zeroGradient;
    }
    zmin
    {
        type            zeroGradient;
    }
    fuel_to_cladding
    {
        type            zeroGradient;
    }
}
