Fuel_Pin/constant/fuel/volPower_o
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "/home/tomas/OpenFOAM/tomas-v2106/run/AP-1000/pin_meshWR_test/constant/fuel";
    object      volPower_o;
}

dimensions      [1 -1 -3 0 0 0 0];

internalField	nonuniform List<scalar>
16000
(
27759456.268247265
27759456.268247265
27759456.268247265
27759456.268247265
27741304.462759428
27759456.268247265
27759456.268247265
27759456.268247265
...
);

boundaryField
{
    zmax
    {
        type            zeroGradient;
    }
    zmin
    {
        type            zeroGradient;
    }
    fuel_to_cladding
    {
        type            zeroGradient;
    }
}
