Fuel_Pin/constant/fuel/volPower_or
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "/home/tomas/OpenFOAM/tomas-v2106/run/AP-1000/pin_meshWR_test/constant/fuel";
    object      volPower_or;
}

dimensions      [1 -1 -3 0 0 0 0];

internalField	nonuniform List<scalar>
16000
(
0.00802
0.00802
0.00802
0.00802
0.00852
0.00802
0.00802
0.00802
...
);

boundaryField
{
    zmax
    {
        type            zeroGradient;
    }
    zmin
    {
        type            zeroGradient;
    }
    fuel_to_cladding
    {
        type            zeroGradient;
    }
}
