Fuel_Pin/system/coolant/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         faceMDLimited Gauss linear 0.5;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss upwind;//linearUpwind grad(U);//upwind; //

    div(phi,k)      bounded Gauss upwind;//linearUpwind grad(k);//linearUpwind grad(k) limitedLinear 1;
    div(phi,epsilon) bounded Gauss upwind;//linearUpwind grad(epsilon) limitedLinear 1;		//linearUpwind
    div(phi,omega)  bounded Gauss upwind;//linearUpwind grad(omega);//linearUpwind grad(omega) limitedLinear 1;		//linearUpwind
    div(phi,zeta)   bounded Gauss upwind limitedLinear 1;
    div(phi,T)      bounded Gauss upwind;//Gauss LUST grad(T);
    div(phi,h)      bounded Gauss upwind;//Gauss LUST grad(T);





    div(phi,K)	    bounded Gauss upwind;//Gauss LUST grad(K); 		//linearUpwind

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
	div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
	div(nonlinearStress)	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;//corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;//corrected;
}
/*
fluxRequired
{
    default         no;
    p               ;
}
*/
wallDist
{
	method meshWave;
}

// ************************************************************************* //
