Fuel_Pin/system/coolant/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p_rgh
    {
        solver			GAMG;
		smoother		DIC;
        //preconditioner  DIC;
		nCellsInCoarsestLevel	2000;
		cacheAgglomeration	on;
		agglomerator		faceAreaPair;
		scaleCorrection		true;
		directSolveCoarsestLevel	false;
		mergeLevels			1;
		nPreSweeps			1;
		nPostSweeps			2;
		nFinestSweeps			2;

        tolerance       1e-6;
        relTol          0.01;
		minIter			2;
		maxIter			20;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-06;
        relTol          0.0;
    }

    f
    {
	solver GAMG;
	//preconditioner	DIC;
	smoother DICGaussSeidel;
	maxIter		150;
	tolerance	1e-8;
	relTol		0.1;
    }

    fFinal
    {
	$f;
	tolerance	1e-8;
    }

    "(U|T|e|k|kU|epsilon|omega|omegaU|zeta)"
    {
        solver          PBiCG; //smoothSolver
		preconditioner	DILU;        
		smoother        symGaussSeidel; 
        nSweeps         2;
        minIter         1;
        tolerance       1e-06;
        relTol          0.00;
    }

    "(U|T|e|k|kU|epsilon|omega|omegaU|zeta)Final"
    {
        $U;
        tolerance       1e-08;
		minIter			1;
        relTol          0.0;
    }
    
    h
    {
        solver          PBiCG; //smoothSolver
		preconditioner	DILU;        
		smoother        symGaussSeidel; 
        nSweeps         2;
        minIter         1;
        tolerance       1e-08;
        relTol          0.0;
    }

    hFinal
    {
        $U;
        tolerance       1e-08;
		minIter			1;
        relTol          0.0;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
//	consistent	yes;
//	nOuterCorrectors 2;
	pRefCell            1;
    pRefValue           0;

	residualControl
	{
		p_rgh	1e-5;
		U	1e-5;
		h	1e-6;
		T	1e-6;
		"(k|epsilon|omega|zeta|f)" 1e-5;
	}
}

relaxationFactors
{
    fields
    {
        p_rgh               0.3;
		f				0.3;
    }
    equations
    {
        U               0.7;
        "(k|T|omega|epsilon|zeta)"   0.7;
        e               0.8;
    	h	        	0.8;
    }

}


PIMPLE
{
	nCorrectors			2;
	nNonOrthogonalCorrectors	0;
	pRefCell	1001;
	pRefValue	1e5;
}



// ************************************************************************* //
