Fuel_Pin/system/cladding/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




expressions
(
	T
    {
        field       T;
        dimensions  [0 0 0 1 0 0 0];
        


        expression #{ 300 + 25*(1+cos(3.14+3.14*pos().z()/0.5)) #};
        
    }
    
    // These now done in 0/T (which is filled from 0/pattern_holder/prior_T)
    /*
    {
        patch   SnoplusAV_intfc0p75_lid;
        target  T; 
        expression #{ (0.0) #};
    }
    
    {
        patch   SnoplusAV_intfc0p75_base;
        target  T; 
        expression #{ (pos().z() < 12.0 ? 0.0-(12.0-pos().z())*0.2 : 0.0) #};
    }
    */

);



// ************************************************************************* //
