Fuel_Pin/system/coolant/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  14;

method          scotch;

regions
{
    fuel
    {
        numberOfSubdomains  14;
        method      simple;

        coeffs
        {
            n       (1 1 14);
        }
    }

	cladding
    {
        numberOfSubdomains  14;
        method      simple;

        coeffs
        {
            n       (1 1 14);
        }
    }

}

coeffs
{
    n       (1 1 1);
}

/*
constraints
{
    //- Keep owner and neighbour on same processor for faces in zones:
    faces
    {
        type    preserveFaceZones;
        zones   (heater solid1 solid3);
    }
}
*/

// ************************************************************************* //
